Revit 2024 API
BuiltInFailures.SketchFailures.PathCannotBeClosedLoop Property
 Path cannot be a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PathCannotBeClosedLoop { get; }
Visual Basic
Public Shared ReadOnly Property PathCannotBeClosedLoop As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PathCannotBeClosedLoop {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace